# -*- coding: utf-8 -*-
"""
Created on Thu Oct 31 15:18:06 2019
https://codeforces.com/group/DIbior3HqT/contest/258122/problem/D
@author: Karapetian
Общий делитель
ограничение по времени на тест1 секунда
ограничение по памяти на тест64 мегабайта
вводстандартный ввод
выводстандартный вывод
Дано число N, ваша задача – найти количество чисел на отрезке от 1 до N, для которых наибольший общий делитель с N больше единицы.

Входные данные
В единственной строке записано натуральное число N (N ≤ 1015).

Выходные данные
Выведите искомое количество чисел.
"""

