# -*- coding: utf-8 -*-
"""
Created on Fri Nov 15 12:56:53 2019
https://codeforces.com/group/DIbior3HqT/contest/259870/problem/B
@author: Karapetian
Шифр Цезаря
ограничение по времени на тест1 секунда
ограничение по памяти на тест64 мегабайта
вводстандартный ввод
выводстандартный вывод
Шифр Цезаря — это вид шифра подстановки, в котором каждый символ в открытом тексте заменяется символом, находящимся на некотором постоянном числе позиций левее или правее него в алфавите. Если в алфавите меньше букв, чем получившийся номер буквы, то отсчет ведется с начала алфавита.

Если мы будем зашифровывать слово “Kenig” используя сдвиг размером 13, то получим следующее:


Ваша задача состоит в том, что бы расшифровать строку.

Входные данные
Вам дана зашифрованная строка, состоящая не более чем из 1000 строчных букв латинского алфавита.

Далее записан размер сдвига k, с помощью которого было зашифровано сообщение (0<=k<=109).

Выходные данные
Выведете исходную строку.
"""
