"""
Задача 1
Рассмотрим все возможные числа ab для 1<a<6 и 1<b<6: 
22=4, 23=8, 24=16, 25=32 32=9, 33=27, 34=81, 35=243 42=16, 43=64, 44=256, 45=1024, 52=25, 53=125, 54=625, 55=3125 
Если убрать повторения, то получим 15 различных чисел. 
Сколько различных чисел ab для 2<a<107 и 2<b<136?
"""
a = []
b = []
c = []
result = []
for el in range(2, 108):
    a.append(el)
for el in range(2, 137):
    b.append(el)

for el in a:
    for ele in b:
        c.append(el**ele)
print(len(set(c)))
